ankuns/nrfx/bsp/stable/mdk/nrf7140_umac.svd
                  <description>Non-Scatter/Gather DMA configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Scatter/Gather DMA configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DESCDMA</name>
              <description>Scatter/Gather DMA configuration</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG1</name>
                  <description>Non Dynamic configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG2</name>
                  <description>Dynamic configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GLPMCFG</name>
          <description>LPM Config Register</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPMCAP</name>
              <description>LPM-Capable (LPMCap)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LPM capability is not enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LPM capability is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPL1RES</name>
              <description>Mode: Device only. LPM response programmed by application  (AppL1Res)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NYET_RESP</name>
                  <description>The core responds with a NYET when an error is detected in either of the LPM token packets due to corruption</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_RESP</name>
                  <description>The core responds with an ACK only on a successful LPM transaction</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRD</name>
              <description>Host-Initiated Resume Duration (HIRD)</description>
              <lsb>2</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>BREMOTEWAKE</name>
              <description>RemoteWakeEnable (bRemoteWake)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Remote Wakeup is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>In Host or device mode, this field takes the value of remote wake up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBLSLPM</name>
              <description>Enable utmi_sleep_n (EnblSlpM)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>utmi_sleep_n assertion from the core is not transferred to the external PHY</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>utmi_sleep_n assertion from the core is transferred to the external PHY when utmi_l1_suspend_n cannot be asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRDTHRES</name>
              <description>BESL/HIRD Threshold (HIRD_Thres)</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>COREL1RES</name>
              <description>LPM Response (CoreL1Res)</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMRESP1</name>
                  <description>ERROR : No handshake response</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMRESP2</name>
                  <description>STALL response</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMRESP3</name>
                  <description>NYET response</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMRESP4</name>
                  <description>ACK response</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLPSTS</name>
              <description>Port Sleep Status (SlpSts)</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORE_NOT_IN_L1</name>
                  <description>In Host or Device mode, this bit indicates core is not in L1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE_IN_L1</name>
                  <description>In Host mode, this bit indicates the core transitions to Sleep state as a successful LPM transaction. In Device mode, the core enters the Sleep state when an ACK response is sent to an LPM transaction</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L1RESUMEOK</name>
              <description>Sleep State Resume OK (L1ResumeOK)</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTOK</name>
                  <description>The application/core cannot start Resume from Sleep state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OK</name>
                  <description>The application/core can start Resume from Sleep state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMCHNLINDX</name>
              <description>LPM Channel Index</description>
              <lsb>17</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>Channel 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>Channel 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>Channel 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>Channel 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4</name>
                  <description>Channel 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5</name>
                  <description>Channel 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6</name>
                  <description>Channel 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7</name>
                  <description>Channel 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH8</name>
                  <description>Channel 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH9</name>
                  <description>Channel 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH10</name>
                  <description>Channel 10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH11</name>
                  <description>Channel 11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH12</name>
                  <description>Channel 12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH13</name>
                  <description>Channel 13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH14</name>
                  <description>Channel 14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH15</name>
                  <description>Channel15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMRETRYCNT</name>
              <description>LPM Retry Count (LPM_Retry_Cnt)</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RETRY0</name>
                  <description>Zero LPM retries</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY1</name>
                  <description>One LPM retry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY2</name>
                  <description>Two LPM retries</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY3</name>
                  <description>Three LPM retries</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY4</name>
                  <description>Four LPM retries</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY5</name>
                  <description>Five LPM retries</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY6</name>
                  <description>Six LPM retries</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY7</name>
                  <description>Seven LPM retries</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNDLPM</name>
              <description>Send LPM Transaction (SndLPM)</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>In host-only mode: Received the response from the device for the LPM transaction</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>In host-only mode: Sending LPM transaction containing EXT and LPM tokens</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMRETRYCNTSTS</name>
              <description>LPM Retry Count Status (LPM_RetryCnt_Sts)</description>
              <lsb>25</lsb>
              <msb>27</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RETRY_REM0</name>
                  <description>Zero LPM retries remaining</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY_REM1</name>
                  <description>One LPM retry remaining</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY_REM2</name>
                  <description>Two LPM retries remaining</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY_REM3</name>
                  <description>Three LPM retries remaining</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY_REM4</name>
                  <description>Four LPM retries remaining</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY_REM5</name>
                  <description>Five LPM retries remaining</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY_REM6</name>
                  <description>Six LPM retries remaining</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRY_REM7</name>
                  <description>Seven LPM retries remaining</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMENBESL</name>
              <description>LPM Enable BESL (LPM_EnBESL)</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>BESL is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>BESL is enabled as defined in LPM Errata</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMRESTORESLPSTS</name>
              <description>LPM Restore Sleep Status (LPM_RestoreSlpSts)</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Puts the core in Shallow Sleep mode based on the BESL value from the Host</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Puts the core in Deep Sleep mode based on the BESL value from the Host</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
