ankuns/nrfx/bsp/stable/mdk/nrf7140_umac.svd
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x018</dimIncrement>
          <name>HC[%s]</name>
          <description>Unspecified</description>
          <headerStructName>USBHSCORE_HC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>CHAR</name>
            <description>Description cluster: Host Channel Characteristics Register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MPS</name>
                <description>Maximum Packet Size (MPS)</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>EPNUM</name>
                <description>Endpoint Number (EPNum)</description>
                <lsb>11</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ENDPT0</name>
                    <description>End point 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT1</name>
                    <description>End point 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT2</name>
                    <description>End point 2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT3</name>
                    <description>End point 3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT4</name>
                    <description>End point 4</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT5</name>
                    <description>End point 5</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT6</name>
                    <description>End point 6</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT7</name>
                    <description>End point 7</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT8</name>
                    <description>End point 8</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT9</name>
                    <description>End point 9</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT10</name>
                    <description>End point 10</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT11</name>
                    <description>End point 11</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT12</name>
                    <description>End point 12</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT13</name>
                    <description>End point 13</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT14</name>
                    <description>End point 14</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDPT15</name>
                    <description>End point 15</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EPDIR</name>
                <description>Endpoint Direction (EPDir)</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OUT</name>
                    <description>OUT Direction</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IN</name>
                    <description>IN Direction</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSPDDEV</name>
                <description>Low-Speed Device (LSpdDev)</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Not Communicating with low speed device</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Communicating with low speed device</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EPTYPE</name>
                <description>Endpoint Type (EPType)</description>
                <lsb>18</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CTRL</name>
                    <description>Control</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ISOC</name>
                    <description>Isochronous</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BULK</name>
                    <description>Bulk</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERR</name>
                    <description>Interrupt</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EC</name>
                <description>Multi Count (MC) / Error Count (EC)</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TRANSONE</name>
                    <description>1 transaction</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRANSTWO</name>
                    <description>2 transactions to be issued for this endpoint per microframe</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRANSTHREE</name>
                    <description>3 transactions to be issued for this endpoint per microframe</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DEVADDR</name>
                <description>Device Address (DevAddr)</description>
                <lsb>22</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>ODDFRM</name>
                <description>Odd Frame (OddFrm)</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EFRAME</name>
                    <description>Even Frame Transfer</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OFRAME</name>
                    <description>Odd Frame Transfer</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHDIS</name>
                <description>Channel Disable (ChDis)</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>Transmit/Recieve normal</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Stop transmitting/receiving data on channel</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHENA</name>
                <description>Channel Enable (ChEna)</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>If Scatter/Gather mode is enabled, indicates that the descriptor structure is not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>If Scatter/Gather mode is enabled, indicates that the descriptor structure and data buffer with data is set up and this channel can access the descriptor. If Scatter/Gather mode is disabled, indicates that the channel is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INT</name>
            <description>Description cluster: Host Channel Interrupt Register</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>XFERCOMPL</name>
                <description>Transfer Completed (XferCompl)</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>Transfer in progress or No Active Transfer</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Transfer completed normally without any errors</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHHLTD</name>
                <description>Channel Halted (ChHltd)</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>Channel not halted</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Channel Halted</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AHBERR</name>
                <description>AHB Error (AHBErr)</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No AHB error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>AHB error during AHB read/write</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STALL</name>
                <description>STALL Response Received Interrupt (STALL)</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No Stall Response Received Interrupt</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Stall Response Received Interrupt</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NAK</name>
                <description>NAK Response Received Interrupt (NAK)</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No NAK Response Received Interrupt</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>NAK Response Received Interrupt</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACK</name>
                <description>ACK Response Received/Transmitted Interrupt (ACK)</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No ACK Response Received or Transmitted Interrupt</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>ACK Response Received or Transmitted Interrup</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NYET</name>
                <description>NYET Response Received Interrupt (NYET)</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No NYET Response Received Interrupt</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>NYET Response Received Interrupt</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>XACTERR</name>
                <description>Transaction Error (XactErr)</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No Transaction Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Transaction Error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BBLERR</name>
                <description>Babble Error (BblErr)</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No Babble Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Babble Error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FRMOVRUN</name>
                <description>Frame Overrun (FrmOvrun).</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No Frame Overrun</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Frame Overrun</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DATATGLERR</name>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>No Data Toggle Error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Data Toggle Error</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
