ankuns/nrfx/bsp/stable/mdk/nrf7140_umac.svd
        <register>
          <name>PCGCCTL</name>
          <description>Power and Clock Gating Control Register</description>
          <addressOffset>0xE00</addressOffset>
          <access>read-write</access>
          <resetValue>0x880A0000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STOPPCLK</name>
              <description>Stop Pclk (StopPclk)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable Stop Pclk</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable Stop Pclk</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GATEHCLK</name>
              <description>Gate Hclk (GateHclk)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Clears this bit when the USB is resumed or a new session starts</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Sets this bit to gate hclk to modules when the USB is suspended or the session is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTPDWNMODULE</name>
              <description>Reset Power-Down Modules (RstPdwnModule)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Power is turned on</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Power is turned off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBLL1GATING</name>
              <description>Enable Sleep Clock Gating</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The PHY clock is not gated in Sleep state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The Core internal clock gating is enabled in Sleep state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYSLEEP</name>
              <description>PHY In Sleep</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Phy not in Sleep state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Phy in Sleep state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L1SUSPENDED</name>
              <description>L1 Deep Sleep</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Non Deep Sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Deep Sleep</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTOREMODE</name>
              <description>Restore Mode (RestoreMode)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>In Host mode,this bit indicates Host-initiated Resume and Reset. In Device mode, this bit indicates Device-initiated Remote Wakeup</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>In Host mode,this bit indicates Device-initiated Remote Wakeup. In Device mode, this bit indicates Host-initiated Resume and Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESSREGRESTORED</name>
              <description>Essential Register Values Restored (EssRegRestored)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_RESTORED</name>
                  <description>Register values of essential registers are not restored</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTORED</name>
                  <description>Register values of essential registers have been restored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTOREVALUE</name>
              <description>Restore Value (RestoreValue)</description>
              <lsb>14</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GSTARFXDIS</name>
          <description>Global STAR Fix Disable Register</description>
          <addressOffset>0xF00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002200</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOSTIGNORESRMTWKUPDIS</name>
              <description>Disable the STAR fix added for Device controller to go back to low power mode when Host ignores Remote wakeup</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Device controller goes back into SUSPENDED state when host ignores Remote Wakeup</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Device controller waits indefinitely without entering SUSPENDED state when host ignores the Remote Wakeup</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESUMEFRMCHKBUSDIS</name>
              <description>Disable the STAR fix added for Device controller to detect lineK and move to RESUMING state after the 50us pull-up delay ends</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Device controller detects line K and resumes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Device controller does not detect line K and resume</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IGNORECTLOUTDATA0DIS</name>
              <description>Disable the STAR fix added for Device controller to reject DATA0 for the first Control OUT Data Phase and Control Status OUT Phase</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Transaction Error reported when host sends DATA0 PID</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Transaction Error not reported when host sends DATA0 PID</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSPLITSTALLNYETERRDIS</name>
              <description>Disable the STAR fix added for Host controller to flag error for SSPLIT STALL/NYET</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Transaction Error reported when device sends STALL/NYET for SSPLIT</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Transaction Error not reported when device sends STALL/NYET for SSPLIT</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCEPTISOCSPLITDATA1DIS</name>
              <description>Disable the STAR fix added for Host controller to accept DATA1 PID from device for ISOC Split transfers</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Transaction Error not reported when device sends DATA1 PID for ISOC Split</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Transaction Error reported when device sends DATA1 PID for ISOC Split</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HANDLEFAULTYCABLEDIS</name>
              <description>Disable the STAR fix added for Host controller to handle Faulty cable scenarios</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Fix for handling faulty cable enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Fix for handling faulty cable disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSIPGINCRDIS</name>
              <description>Disable the STAR fix added for Host controller LS mode IPG increment from 2 LS bit times to 3 LS bit times</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Host LS mode IPG is 3 LS bit times</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Host LS mode IPG is 2 LS bit times</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSDISCIDLEDIS</name>
              <description>Disable the STAR fix added for Device controller to transition to IDLE state during FS device disconnect</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Device controller transitions to IDLE state during FS device disconnect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Device controller does not transition to IDLE state during FS device disconnect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONCURRENTRMTWKUPUSBRESUMEDIS</name>
              <description>Disable the STAR fix added for Device controller to not start Remote Wakeup signalling when USB resume has already started</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Device controller does not start remote wakeup signalling when host resume has already started</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Device controller is allowed to start remote wakeup signalling when host resume has already started</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONCURRENTRMTWKUPUSBRESUMEHIBDIS</name>
              <description>Disable the STAR fix added for Device controller to not hang when Remote Wakeup signalling clashes with Host resume</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Device controller does not hang when remote wakeup signalling clashes with host resume during Hibernation exit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Device controller hangs when remote wakeup signalling clashes with host resume during Hibernation exit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSIPGCHKAFTERNAKSTALLFORINDIS</name>
              <description>Disable the STAR fix added for Host controller to wait for IPG duration to send next token after receiving NAK/STALL for previous IN token with FS/LS device</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Host controller checks IPG after NAK/STALL for IN token</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Host controller does not check IPG after NAK/STALL for IN token</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYIOPXCVRSELTXVLDCORRDIS</name>
              <description>Disable the STAR fix added for Host controller to increase the gap between utmi_xcvrselect switching and utmi_txvalid assertion in LS/FS mode</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Host controller asserts utmi_txvalid at least 2 utmi_clk cycles after utmi_xcvrselect switching</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Host controller can assert utmi_txvalid after 1 utmi_clk cycle of utmi_xcvrselect switching</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ULPIXCVRSELSWITCHCORRDIS</name>
              <description>Disable the STAR fix added for Host controller to increase the preamble transceiver select switch delay to accommodate time taken for ULPI function control write</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Host controller waits for previous functional register update to complete before switching the transceiver select again or asserting txvalid</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Host controller does not wait for the previous functional register update to complete before switching the transceiver select again or asserting txvalid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XACTERRDATA0CTRLSTSINDIS</name>
              <description>Disable the STAR fix added for Host controller to report transaction error when DATA0 PID is received for CTRL STATUS IN transfer in DMA mode</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Host controller reports transaction error when DATA0 PID is received for CTRL STATUS IN transfer in DMA mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Host controller retries the transfer when DATA0 PID is received for CTRL STATUS IN transfer in DMA mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOSTUTMITXVLDCORRDIS</name>
              <description>Disable the correction to OpMode/XcvrSel/TermSel on UTMI Interface in Host mode.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Opmode, XcvrSel, TermSel are changed by the Host Controller after TxValid goes LOW (1'b0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Opmode, XcvrSel, TermSel are changed by the Host Controller without waiting for TxValid to go LOW (1'b0) during SOF transmission</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPMODEXCVRSELCHIRPENCORRDIS</name>
              <description>Disable the STAR fix added for correcting Opmode and XcvrSel on UTMI Interface when reset is detected in suspend state.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Valid Combination of Opmode and XcvrSel is driven when reset is detected in suspend state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Invalid Combination of Opmode and XcvrSel is driven when reset is detected in suspend state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXVALIDDEASSERTIONCORRDIS</name>
              <description>Disable the STAR fix added for correcting Txvalid deassertion on UTMI Interface when soft disconnect is done.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Txvalid is deasserted during soft disconnect after receiving Txready from the PHY</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Txvalid is deasserted during soft disconnect without waiting for Txready from the PHY</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOSTNOXFERAFTERPRTDISFIXDIS</name>
              <description>Disable the STAR fix added for correcting Host behavior when port is disabled.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_FIX</name>
                  <description>Txvalid is not asserted when port is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_FIX</name>
                  <description>Txvalid can be asserted when port is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
