ankuns/nrfx/bsp/stable/mdk/nrf7140_umac.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_ETR</name>
      <description>Embedded Trace Router</description>
      <baseAddress>0xBF045000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ETR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>RSZ</name>
          <description>RAM Size register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSZ</name>
              <description>Size of the RAM in 32-bit words.</description>
              <lsb>0</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STS</name>
          <description>Status Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000C</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FULL</name>
              <description>This bit can be used to help determine how much of the trace buffer contains valid data.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>TRIGGERED</name>
              <description>The Triggered bit is set when trace capture is in progress and the TMC has detected a trigger event.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>TMCREADY</name>
              <description>TMC ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>FTEMPTY</name>
              <description>This bit is set when trace capture has stopped, and all internal pipelines and buffers have drained.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>EMPTY</name>
              <description>If set, this bit indicates that the TMC does not contain any valid trace data in the trace memory.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>MEMERR</name>
              <description>This bit indicates that an error has occurred on the AXI master interface.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RRD</name>
          <description>RAM Read Data Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RRD</name>
              <description>Reads return data from Trace RAM</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RRP</name>
          <description>RAM Read Pointer Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RRP</name>
              <description>This value represents the location in trace memory that will be accessed on a subsequent RRD read.</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RWP</name>
          <description>RAM Write Pointer Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RWP</name>
              <description>This value represents the location in trace memory that will be accessed on a subsequent write to the trace memory.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRG</name>
          <description>Trigger Counter Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRG</name>
              <description>This count represents the number of 32-bit words between a TRIGIN/trigger packet and a trigger event.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Control Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRACECAPTEN</name>
              <description>Setting this bit to 1 enables the TMC to capture trace data.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RWD</name>
          <description>RAM Write Data Register</description>
          <addressOffset>0x24</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RWD</name>
              <description>Data written to this register is placed in the Trace RAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Mode Register</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Selects the operating mode.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIRCULARBUF</name>
                  <description>Circular Buffer mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO</name>
                  <description>Software FIFO mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LBUFLEVEL</name>
          <description>Latched Buffer Fill Level</description>
          <addressOffset>0x2C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LBUFLEVEL</name>
              <description>Indicates the maximum fill level of the trace memory in 32-bit words since this register was last read.</description>
              <lsb>0</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CBUFLEVEL</name>
          <description>Current Buffer Fill Level</description>
          <addressOffset>0x30</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CBUFLEVEL</name>
              <description>Indicates the current fill level of the trace memory in 32-bit words.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFWM</name>
          <description>Buffer Level Water Mark</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFWM</name>
              <description>Indicates the desired threshold vacancy level in 32-bit words in the trace memory.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RRPHI</name>
          <description>RAM Read Pointer High Register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RRPHI</name>
              <description>Bits[39:32] of the read pointer</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RWPHI</name>
          <description>RAM Write Pointer High Register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RWPHI</name>
              <description>Bits[39:32] of the write pointer</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AXICTL</name>
          <description>AXI Control Register</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PROTCTRLBIT0</name>
              <description>This bit controls the value driven on ARPROTM[0]/AWPROTM[0] on the AXI interface when performing AXI transfers.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>PROTCTRLBIT1</name>
              <description>This bit controls the value driven on ARPROTM[1]/AWPROTM[1] on the AXI interface when performing AXI transfers.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CACHECTRLBIT0</name>
              <description>This bit controls the value driven on the ARCACHEM[0]/AWCACHEM[0] signal on the AXI interface when performing AXI transfers.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CACHECTRLBIT1</name>
              <description>This bit controls the value driven on the ARCACHEM[1]/AWCACHEM[1] signal on the AXI interface when performing AXI transfers.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CACHECTRLBIT2</name>
              <description>This bit controls the value driven on the ARCACHEM[2]/AWCACHEM[2] signal on the AXI interface when performing AXI transfers.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CACHECTRLBIT3</name>
              <description>This bit controls the value driven on the ARCACHEM[3]/AWCACHEM[3] signal on the AXI interface when performing AXI transfers.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>SCATTERGATHERMODE</name>
              <description>This bit indicates whether trace memory is accessed as a single buffer in system memory or as a linked-list based scatter-gather memory.</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>WRBURSTLEN</name>
              <description>This field indicates the maximum number of data transfers that can occur within each burst initiated by the TMC on the AXI interface.</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DBALO</name>
          <description>Data Buffer Address Low Register</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFADDRLO</name>
              <description>Holds the lower 32 bits of the 40-bit address used to locate the trace buffer in system memory</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DBAHI</name>
          <description>Data Buffer Address High Register</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFADDRHI</name>
              <description>Holds the upper 8 bits of the 40-bit address used to locate the trace buffer in system memory</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FFSR</name>
          <description>Formatter and Flush Status Register</description>
          <addressOffset>0x300</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FLINPROG</name>
              <description>This bit indicates whether the TMC is currently processing a flush on the ATB slave port. This bit reflects the status of the AFVALIDS output. The flush initiation is controlled by the flush-control bits in the FFCR register.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FTSTOPPED</name>
              <description>This bit behaves the same way as the FtEmpty bit in the STS register, 0x00C.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FFCR</name>
          <description>Formatter and Flush Control Register</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENFT</name>
              <description>If this bit is set, formatting is enabled.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ENTI</name>
              <description>Setting this bit enables the insertion of triggers in the formatted trace stream.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FONFLIN</name>
              <description>Setting this bit enables the detection of transitions on the FLUSHIN input by the TMC.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>FONTRIGEVT</name>
              <description>Setting this bit generates a flush when a Trigger event occurs.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>FLUSHMAN</name>
              <description>Manually generate a flush of the system.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>TRIGONTRIGIN</name>
              <description>If this bit is set, a trigger is indicated on the trace stream when a rising edge is detected on the TRIGIN input.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TRIGONTRIGEVT</name>
              <description>If this bit is set, a trigger is indicated on the output trace stream when a Trigger Event occurs.</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>TRIGONFL</name>
              <description>If this bit is set, a trigger is indicated on the trace stream on AFREADYS being returned.</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>STOPONFL</name>
              <description>If this bit is set, the formatter is stopped on completion of a flush operation.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>STOPONTRIGEVT</name>
              <description>If this bit is set, the formatter is stopped when a Trigger Event has been observed.</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>DRAINBUFFER</name>
              <description>This bit is used to enable draining of the trace data through the ATB Master interface after the formatter has stopped.</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PSCR</name>
          <description>Periodic Synchronization Counter Register</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PSCOUNT</name>
              <description>The reload value of the Synchronization Counter</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBMCTR0</name>
          <description>Integration Test ATB Master Interface Control 0 Register</description>
          <addressOffset>0xEDC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATVALIDM</name>
              <description>Set the value of ATVALIDM output</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AFREADYM</name>
              <description>Set the value of AFREADYM output</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ATBYTESM</name>
              <description>Control the value of ATBYTESM output from TMC. The value written to this field is driven on the ATBYTESM output of the TMC.</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITMISCOP0</name>
          <description>Integration Test Miscellaneous Output Register 0</description>
          <addressOffset>0xEE0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACQCOMP</name>
              <description>Set the value of the ACQCOMP output.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FULL</name>
              <description>Set the value of the FULL output.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITTRFLIN</name>
          <description>Integration Test Trigger In and Flush In Register</description>
          <addressOffset>0xEE8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>Read the value of the TRIGIN input.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FLUSHIN</name>
              <description>Read the value of the FLUSHIN input.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
