ankuns/nrfx/bsp/stable/mdk/nrf7140_umac.svd
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Retention on</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM29</name>
                <description>Keep the second bank in RAM block MEM[29] retained when parent power domain of the RAM is off.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Retention off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Retention on</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM30</name>
                <description>Keep the second bank in RAM block MEM[30] retained when parent power domain of the RAM is off.</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Retention off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Retention on</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM31</name>
                <description>Keep the second bank in RAM block MEM[31] retained when parent power domain of the RAM is off.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Retention off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Retention on</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>192</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>REPAIR[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_MEMCONF_REPAIR</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>BITLINE</name>
            <description>Description cluster: Repair configuration for RAM blocks.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Repair address of the bitline</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable bitline repair</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Repair disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Repair enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>64</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>BLOCKTYPE[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_MEMCONF_BLOCKTYPE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>TRIM</name>
            <description>Description cluster: Trim configuration for the memory block types.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MEMTRIM_0</name>
                <description>Read/write margin trim.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MEMTRIM_1</name>
                <description>Read/write margin trim.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>MEMTRIM_2</name>
                <description>Read/write margin trim.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MEMTRIM_3</name>
                <description>Read/write margin trim.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>MEMTRIM_4</name>
                <description>Read/write margin trim.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>MEMTRIM_5</name>
                <description>Read/write margin trim.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>MEMTRIM_6</name>
                <description>Read/write margin trim.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>MEMTRIM_7</name>
                <description>Read/write margin trim.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MEMTRIM_8</name>
                <description>Read/write margin trim.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>MEMTRIM_9</name>
                <description>Read/write margin trim.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>MEMTRIM_10</name>
                <description>Read/write margin trim.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>MEMTRIM_11</name>
                <description>Read/write margin trim.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>MEMTRIM_12</name>
                <description>Read/write margin trim.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>MEMTRIM_13</name>
                <description>Read/write margin trim.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>MEMTRIM_14</name>
                <description>Read/write margin trim.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>MEMTRIM_15</name>
                <description>Read/write margin trim.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MEMRETTRIM_0</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>MEMRETTRIM_1</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>MEMRETTRIM_2</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>MEMRETTRIM_3</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>MEMRETTRIM_4</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>MEMRETTRIM_5</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>MEMRETTRIM_6</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>MEMRETTRIM_7</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>MEMRETTRIM_8</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>MEMRETTRIM_9</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>MEMRETTRIM_10</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>MEMRETTRIM_11</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>MEMRETTRIM_12</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>MEMRETTRIM_13</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>MEMRETTRIM_14</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>MEMRETTRIM_15</name>
                <description>Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
