ankuns/nrfx/bsp/stable/mdk/nrf7140_umac.svd
          <register>
            <name>GPUCGCTRL</name>
            <description>Clock gating controller</description>
            <addressOffset>0x094</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CL</name>
                <description>Disable clock gating for the Command List Processor</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RF</name>
                <description>Disable clock gating for the NemaP Configuration Register File</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RAST</name>
                <description>Disable clock gating for the NemaP Rasterizer</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ROPC0</name>
                <description>Disable clock gating for the Render Output Unit of core 0</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ROPC1</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ROPC2</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ROPC3</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>BUSTEXC0</name>
                <description>Disable clock gating for the BusInterface (memory System) and Core 0 Texture Map</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TEXC1</name>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TEXC2</name>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>TEXC3</name>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>PIPEC0</name>
                <description>Disable clock gating for Core 0 Pipeline</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>PIPEC1</name>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>PIPEC2</name>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>PIPEC3</name>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>RFC0</name>
                <description>Disable clock gating for Core 0 Register File</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RFC1</name>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>RFC2</name>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>RFC3</name>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>SCHC0</name>
                <description>Disable clock gating for Core 0 Scheduler</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>SCHC1</name>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>SCHC2</name>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>SCHC3</name>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>C0</name>
                <description>Disable clock gating for Core 0</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>C1</name>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>C2</name>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>C3</name>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>MEMC0</name>
                <description>Disable clock gating for Core 0 Instruction Memory</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>MEMC1</name>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>MEMC2</name>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>MEMC3</name>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>ALL</name>
                <description>Disable clock gating for all modules</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDIRTYMIN</name>
            <description>Read the Dirty_Min value. Resets dirty region to resolution size on write function.</description>
            <addressOffset>0x098</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DIRTYMIN</name>
                <description>Write any value to reset dirty region to resolution size</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDIRTYMAX</name>
            <description>Read the Dirty_Max value</description>
            <addressOffset>0x09C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DIRTYMAX</name>
                <description>Read the Dirty_max value</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCONVCOEFRAB</name>
            <description>Specifies the YUV coefficients for Red color. Part one</description>
            <addressOffset>0x0A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCONVCOEFRA</name>
                <description>Specifies the YUV coefficients for Red color. Part A</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GPUCONVCOEFRB</name>
                <description>Specifies the YUV coefficients for Red color. Part B</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCONVCOEFRCD</name>
            <description>Specifies the YUV coefficients for Red color. Part two</description>
            <addressOffset>0x0A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCONVCOEFRC</name>
                <description>Specifies the YUV coefficients for Red color. Part C</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GPUCONVCOEFRD</name>
                <description>Specifies the YUV coefficients for Red color. Part D</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCONVCOEFGAB</name>
            <description>Specifies the YUV coefficients for Green color. Part one</description>
            <addressOffset>0x0A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCONVCOEFGA</name>
                <description>Specifies the YUV coefficients for Green color. Part A</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GPUCONVCOEFGB</name>
                <description>Specifies the YUV coefficients for Green color. Part B</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCONVCOEFGCD</name>
            <description>Specifies the YUV coefficients for Gren color. Part two</description>
            <addressOffset>0x0AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCONVCOEFGC</name>
                <description>Specifies the YUV coefficients for Green color. Part C</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GPUCONVCOEFGD</name>
                <description>Specifies the YUV coefficients for Green color. Part D</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCONVCOEFBAB</name>
            <description>Specifies the YUV coefficients for Blue color. Part one</description>
            <addressOffset>0x0B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCONVCOEFBA</name>
                <description>Specifies the YUV coefficients for Blue color. Part A</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GPUCONVCOEFBB</name>
                <description>Specifies the YUV coefficients for Blue color. Part B</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCONVCOEFBCD</name>
            <description>Specifies the YUV coefficients for Blue color. Part two</description>
            <addressOffset>0x0B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCONVCOEFBC</name>
                <description>Specifies the YUV coefficients for Blue color. Part C</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GPUCONVCOEFBD</name>
                <description>Specifies the YUV coefficients for Blue color. Part D</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCRCM0</name>
            <description>On read returns the CRC form Write Channel 0</description>
            <addressOffset>0x0B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCRCM0</name>
                <description>NEMA_CRC_M0</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCRCM1</name>
            <description>On read returns the CRC form Write Channel 1</description>
            <addressOffset>0x0BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCRCM1</name>
                <description>NEMA_CRC_M1</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBUSCTRL</name>
            <description>Indicates the value of the AWCACHE and the ARCACHE signals of the AXI Bus Interface.</description>
            <addressOffset>0x0C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ARCACHE</name>
                <description>Specifies the value of the output ARCACHE signal of the AXI Master Read Bus Interface</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>AWCACHE</name>
                <description>Specifies the value of the output AWCACHE signal of the AXI Master Write Bus Interface</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GPUBUSCTRLPOS08LEN24</name>
                <lsb>8</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUIMEMADDR</name>
            <description>Load shader instruction memory address. This register can be auto incremented. Its content</description>
            <addressOffset>0x0C4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Specifies the load shader instruction memory address</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>GPUIMEMADDRPOS04LEN28</name>
                <lsb>4</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUIMEMDATALOW</name>
            <description>The lower bits (31-0) of the 64-bit load shader instruction memory data</description>
            <addressOffset>0x0C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IMEMDATALOW</name>
                <description>Specifies the lower bits (31-0) of the load shader instruction memory data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUIMEMDATAHIGH</name>
            <description>The higher bits (63-32) of the 64-bit load shader instruction memory data</description>
            <addressOffset>0x0CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IMEMDATAHIGH</name>
                <description>Specifies the higher bits (63-32) of the load shader instruction memory data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBURSTSIZE</name>
            <description>Controls the size of the burst for the texture and framebuffer read.</description>
            <addressOffset>0x0D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TEXBURSTSIZE</name>
                <description>Value of the texture read burst size in log2(bytes).</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>FBBURSTSIZE</name>
                <description>Value of the framebuffer read burst size in log2(bytes).</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POS08LEN24</name>
                <lsb>8</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUAHBBUSCTRL</name>
            <description>Controls aspects of the AHB bus interface</description>
            <addressOffset>0x0E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PACKEREN</name>
                <description>Enables or disables the packing of AHB transactions into 32-bit bursts when applicable</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>POS01LEN31</name>
                <lsb>1</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUFLUSHCTRL</name>
            <description>Controls the system flush</description>
            <addressOffset>0x0E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000007</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>READFLUSHCMD</name>
                <description>If set to 1, the read caches are flushed when the Command List Processor triggers the Rasterizer (Register NEMA_DRAW_CMD_NOHOLD)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>GPUFLUSHCTRLPOS01LEN03</name>
                <lsb>1</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>READFLUSHHOST</name>
                <description>If set to 1, the read caches are fluhsed when the Host triggers the Rasterizer (Register NEMA_DRAW_CMD_NOHOLD)</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>GPUFLUSHCTRLPOS05LEN01</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>READFLUSH</name>
                <description>When set to 1, flush read caches</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>WRITEFLUSHCMD</name>
                <description>If set to 1, the write caches are flushed when the Command List Processor triggers the Rasterizer (Register NEMA_DRAW_CMD_NOHOLD)</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GPUFLUSHCTRLPOS08LEN03</name>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>WRITEFLUSHHOST</name>
                <description>If set to 1, the write caches are flushed when the Host triggers the Rasterizer (Register NEMA_DRAW_CMD_NOHOLD)</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>GPUFLUSHCTRLPOS12LEN01</name>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>WRITEFLUSH</name>
                <description>When set to 1, flush write caches</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>GPUFLUSHCTRLPOS14LEN18</name>
                <lsb>14</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
